team/case5/pimpleInOut/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
 (0 5 0)  //0
 (10 5 0)  //1
 (14 5 0)  //2
 (28 5 0)  //3
 (32 5 0)  //4
 (42 8 0)  //5
 (0 10 0)  //6
 (10 10 0)  //7
 (14 10 0)  //8
 (28 10 0)  //9
 (32 10 0)  //10
 (42 10 0)  //11
 (28 -5 0)  //12
 (32 -5 0)  //13
 (6 20 0)  //14
 (10 20 0)  //15 
 (0 0 0)  //dummy 16
    (0 0 0)  //dummy 17
    (0 0 0)  //dummy 18
    (0 0 0)  //dummy 19
    (0 5 0.1)    //20	 
    (10 5 0.1)    //21	 
    (14 5 0.1)    //22	 
    (28 5 0.1)    //23	 
    (32 5 0.1)    //24	 
    (42 8 0.1)    //25	 
    (0 10 0.1)    //26	 
    (10 10 0.1)    //27	 
    (14 10 0.1)    //28	 
    (28 10 0.1)    //29	 
    (32 10 0.1)    //30 
    (42 10 0.1)    //31 
    (28 -5 0.1)   //32
    (32 -5 0.1)   //33
    (6 20 0.1)    //34	 
    (10 20 0.1)    //35 
);

blocks
(
    hex (0 1 7 6 20 21 27 26) (20 20 1) simpleGrading (1 1 1)
    hex (1 2 8 7 21 22 28 27) (8 20 1) simpleGrading (1 1 1)
    hex (2 3 9 8 22 23 29 28) (28 20 1) simpleGrading (1 1 1)
    hex (3 4 10 9 23 24 30 29) (8 20 1) simpleGrading (1 1 1)
    hex (4 5 11 10 24 25 31 30) (20 20 1) simpleGrading (1 1 1)
    hex (12 13 4 3 32 33 24 23) (8 40 1) simpleGrading (1 1 1)
    hex (7 8 15 14 27 28 35 34) (8 40 1) simpleGrading (1 1 1)
);

edges
(
  spline 4 5
  (
    (33 6 0)
    (35 7 0)
    (41.5 8 0)
  )
  
  spline 24 25
  (
    (33 6 0.1)
    (35 7 0.1)
    (41.5 8 0.1)
   )
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (7 6 26 27)
	    (14 7 27 34)
	    (8 15 35 28)
	    (9 8 28 29)
	    (10 9 29 30)
	    (11 10 30 31)
	    (4 5 25 24)
	    (13 4 24 33)
	    (3 12 32 23)
	    (2 3 23 22)
	    (1 2 22 21)
	    (0 1 21 20)
        );
    }
    inlet1
    {
        type patch;
        faces
        (
            (0 20 26 6)
        );
    }
    inlet2
    {
        type patch;
        faces
        (
            (15 14 34 35)
        );
    }
    outlet1
    {
        type patch;
        faces
        (
            (5 11 31 25)
        );
    }
    outlet2
    {
        type patch;
        faces
        (
            (12 13 33 32)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
